- [ ] Create a new notebook,Â `knn_model`, and work with the titanic dataset to answer the following:

In [12]:
# Import full libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Import personal modules
import acquire as a
import prepare as p
import model as m

# Selective imports
from sklearn.neighbors import KNeighborsClassifier
from sklearn import metrics

# Handle warnings
import warnings
warnings.filterwarnings("ignore")

In [26]:
# import Titanic
raw_titanic = a.get_titanic_data()

# Check data
a.df_info(raw_titanic)

Reading from file...

              nunique   dtypes  isnull       sample
passenger_id      891    int64       0          169
survived            2    int64       0            0
pclass              3    int64       0            3
sex                 2   object       0         male
age                88  float64     177         28.0
sibsp               7    int64       0            0
parch               7    int64       0            0
fare              248  float64       0      56.4958
embarked            3   object       2            S
class               3   object       0        Third
deck                7   object     688          NaN
embark_town         3   object       2  Southampton
alone               2    int64       0            1

In [28]:
# Clean Titanic
titanic = p.prep_titanic(raw_titanic)

# check data
a.df_info(titanic)

              nunique   dtypes  isnull       sample
passenger_id      891   object       0           79
survived            2   object       0            1
pclass              3   object       0            3
sex                 2   object       0       female
age                91  float64       0         30.0
sibsp               7   object       0            0
parch               7   object       0            0
fare              248  float64       0       12.475
embark_town         3   object       0  Southampton
alone               2   object       0            1

In [32]:
# Split Titanic
df_sets = train,validate,test = p.split_df(titanic,'survived')

# check train
a.df_info(train)

              nunique   dtypes  isnull       sample
passenger_id      534   object       0          200
survived            2   object       0            0
pclass              3   object       0            3
sex                 2   object       0         male
age                79  float64       0         28.0
sibsp               7   object       0            0
parch               6   object       0            0
fare              194  float64       0          9.5
embark_town         3   object       0  Southampton
alone               2   object       0            1

In [34]:
for df in df_sets:
    print(f'Shape: {df.shape}')

Shape: (534, 10)
Shape: (178, 10)
Shape: (179, 10)

In [20]:
# Encode Titanic


# check encoded train

In [22]:
# Get X's

# check x_train

In [24]:
# Get y's

# check y_train

1. [ ] Fit a K-Nearest Neighbors classifier to your training sample and transform (i.e. make predictions on the training sample)

2. [ ] Evaluate your results using the model score, confusion matrix, and classification report.

3. [ ] Print and clearly label the following: Accuracy, true positive rate, false positive rate, true negative rate, false negative rate, precision, recall, f1-score, and support.

4. [ ] Run through steps 1-3 setting k to 10

5. [ ] Run through steps 1-3 setting k to 20

6. [ ] What are the differences in the evaluation metrics? Which performs better on your in-sample data? Why?

7. [ ] Which model performs best on our out-of-sample data fromÂ `validate`?